// задача про животных
// Есть ферма животных, у всех животных есть имена и возраст. 
// Животные бывают разных типов: Кошки, Собаки, Коровы. 
// У каждого животного могут быть дети. 
// Опишите структуры данных для фермы животных и напишите функцию, 
// которая делает подсчёт всех возрастов животных 
// и выводит общий возраст для всей фермы.

// const farm = ['cat', 'dog', 'cow']


// const cat = {
//   name: 'catName',
//   age: 1,
//   child: []
// }
// console.log(cat)

// const dog = {
//   name: 'dogName',
//   age: 2,
//   child: []
// }
// console.log(dog)

// const cow = {
//   name: 'cowName',
//   age: 3,
//   child: []
// }
// console.log(cow)


// console.log(farm)

















